Resources/Chapter_17_Proxy_Services/requestBody.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <getQuote xmlns="http://services.samples">
      <request>
        <symbol>IBM</symbol>
      </request>
    </getQuote>
  </soap:Body>
</soap:Envelope>
